type_string = "Выберите тип заметки с помощью клавиатуры."
privacy_string = "Выбор вариант приватности заметки с помощью клавиатуры."
text_string = "Введите текст записки."
money_string = ("Введите {сумму} {код валюты}\n"
                "Например: 10 RUB / 15 USD")
photo_string = "Прикрепите нужное фото."
correct_creation = "Вы успешно добавили заметку."


class Error:
    no_notes_yet = "Больше нет доступных заметок."
    first_note = "Эта самая первая заметка."
    last_note = "Эта самая последняя заметка."
    no_notes = "Нет доступных заметок."
    invalid_currency = "Введите {сумму} {код валюты} правильно."
    invalid_privacy = "Выберите вариант приватности именно с помощью клавиатуры."
    invalid_type = "Выберите тип заметки именно с помощью клавиатуры."
